<!-- dflook/terraform-github-actions {"workspace":"multiline-masking","backend":"90d9b15b3297787a6dd7d6aef24767929cd9acbb99a3262573ec47afb59eea24","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #263 at https://github.com/dflook/terraform-github-actions/actions/runs/3313813784","plan_hash":"90ebbe04e0a11924ed80f8c6ed9523637d3c78e51e1e83a0b098574af213cf03","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __multiline-masking__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "aQJ4WFI2Bw" -> (known after apply)
  ~ foreach = "UzllcGnWcU" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #263](https://github.com/dflook/terraform-github-actions/actions/runs/3313813784)